tinyNozzle/2D/6_with3outlets_cyclic_volume_3.27Exit_sharp_10deg_03/0/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{


    outlet
    {
        type            calculated;
        value           uniform 0;
    }
 

    inlet
    {
        type            calculated;
        value           uniform 0;
    }	

    wall
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }

    front
    {
	type		wedge;
    }
    back
    {
        type            wedge;
    }

}


// ************************************************************************* //
